In [1]:
import pandas as pd

## Data frame basic

In [60]:
df =  pd.read_csv("./Downloads/weather_data.csv")

In [3]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## Creating own python dataframe by making dictionari

In [5]:
wd = {
    "day" : [ "1/1/2017", "1/2/2017", "1/3/2017","1/4/2017","1/5/2017" , "1/6/2017" ] ,
    'temparature' : [32, 35, 28 ,24,32,31] ,
    'windspeed' : [6,7,28,24,32,31] ,
     "event" :  ["rain" ,"sunny" ,"snow" ,"rain" ,"sunny" ,"sunny" ] 
}

In [6]:
wd["day"]

['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017']

In [7]:
df2 = pd.DataFrame(wd)

In [8]:
df2

        day  temparature  windspeed  event
0  1/1/2017           32          6   rain
1  1/2/2017           35          7  sunny
2  1/3/2017           28         28   snow
3  1/4/2017           24         24   rain
4  1/5/2017           32         32  sunny
5  1/6/2017           31         31  sunny

In [9]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [10]:
df.shape

(6, 4)

In [11]:
rows , column = df.shape

In [12]:
rows

6

In [13]:
df.head

<bound method NDFrame.head of         day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny>

In [14]:
df.tail

<bound method NDFrame.tail of         day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny>

In [15]:
df.tail(1)

        day  temperature  windspeed  event
5  1/6/2017           31          2  Sunny

In [16]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [17]:
df[:]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [18]:
df.columns.size

4

In [19]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [20]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df[["event" ,"day"]]

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

## Finding maximum temparature

In [23]:
df['temperature'].max()

35

## finding minimum temperature

In [24]:
df['temperature'].min()

24

# finding description of  data frame

In [25]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [26]:
df[df.temperature>30]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [27]:
 df3  =  df[df.temperature ==  df.temperature.max()]

In [28]:
df3

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [29]:
df3.day

1    1/2/2017
Name: day, dtype: object

In [30]:
df["day"][df.temperature ==  df. temperature.max()]

1    1/2/2017
Name: day, dtype: object

In [31]:
df[["day" , "event"]][df.temperature == df.temperature.max()]

        day  event
1  1/2/2017  Sunny

In [32]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [33]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [34]:
df.set_index("day")

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [35]:
df.index[1]

1

In [36]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## diferent ways to create dataframme

In [37]:
df  = pd.read_csv("./Downloads/weather_data.csv")

In [38]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [39]:
 ex = pd.read_excel("./Downloads/weather_data.xlsx")

In [40]:
ex

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

## read csv file  and write on it

In [41]:
df =  pd.read_csv("./Downloads/stock_data.csv" )

In [42]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [43]:
df =  pd.read_csv("./Downloads/stock_data.csv" )

In [44]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [45]:
df =  pd.read_csv("./Downloads/stock_data.csv" ,nrows=3 )

In [46]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

## cleaning of measy data

In [47]:
df =  pd.read_csv("./Downloads/stock_data.csv" ,na_values =["not available" ,"n.a.", -1])

In [48]:
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [49]:
df.describe

<bound method NDFrame.describe of   tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata>

In [50]:
df =  pd.to_csv("./Downloads/stock_data.csv" , index=False )

AttributeError: module 'pandas' has no attribute 'to_csv'

 ## to_csv

In [ ]:
df.to_csv("new.csv")

In [ ]:
df

In [ ]:
df.columns

In [ ]:
df.to_csv("new2.csv" , columns= ["tickers","eps"])

In [53]:
def convert_people_cell(cell) :
     if cell =="n.a." :
            return cell 
        
excel = pd.read_excel("./Downloads/stock_data.xlsx","Sheet1" )

In [54]:
excel

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
excel

In [ ]:
def convert_people_cell(cell) :
     if cell =="n.a." :
            return "sam walton" 
     return cell

In [ ]:
excel = pd.read_excel("./Downloads/stock_data.xlsx","Sheet1" ,converters ={
    'people' : convert_people_cell 
    
} )

In [ ]:
excel

In [ ]:
def convert_eps_cell(cell):
    if(cell== "not available"):
        return None 
    return cell

In [51]:
excel = pd.read_excel("./Downloads/stock_data.xlsx","Sheet1" , converters={
     'eps' : convert_eps_cell,
    'people' : convert_people_cell
} )

NameError: name 'convert_eps_cell' is not defined

In [ ]:
excel

In [ ]:
excel.to_excel("new_excell.xlsx")

In [55]:
excel

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

## Handling Missing Dataa

# 1.Fillna

In [57]:
df= pd.read_csv("./Downloads/weather_data(2).csv")

In [58]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [59]:
## making string date to

TypeError: 'Series' object is not callable